CSI API ETABS v1

# cCaseStaticNonlinear Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cCaseStaticNonlinear

    Public Interface cCaseStaticNonlinear

    Dim instance As cCaseStaticNonlinear

    public interface class cCaseStaticNonlinear

    type cCaseStaticNonlinear =  interface end

The cCaseStaticNonlinear type exposes the following members.

Methods

| Name| Description
---|---|---
| [GetGeometricNonlinearity](343070dd-
bd74-80ac-a209-01d56a517ae3.htm)|
|
GetHingeUnloading|
|
GetInitialCase|
|
GetLoadApplication|
|
GetLoads|  Retrieves the load data
for the specified load case
|
GetMassSource|
|
GetModalCase|
|
GetResultsSaved|
|
GetSolControlParameters|
|
GetTargetForceParameters|
|
SetCase|  Initializes a static
nonlinear load case.
|
SetGeometricNonlinearity|  Sets
the geometric nonlinearity option for the specified load case.
|
SetHingeUnloading|
|
SetInitialCase|
|
SetLoadApplication|
|
SetLoads|  Sets the load data for
the specified analysis case.
| [SetMassSource](e7871c09-bf0d-29ef-
ed9a-349d6c09914b.htm)|
|
SetModalCase|
|
SetResultsSaved|
|
SetSolControlParameters|
|
SetTargetForceParameters|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com